{"meta":{"title":"一花一菩提，一云一世界","subtitle":"佛系ICT人士技术博客","description":"5G，SDN/NFV，云计算，大数据，自动化运维，Linux，Python，机器学习","author":"kkutysllb","url":"https://kkutysllb.cn"},"pages":[{"title":"文章分类","date":"2019-02-18T06:37:56.000Z","updated":"2019-02-18T06:46:52.062Z","comments":false,"path":"categories/index.html","permalink":"https://kkutysllb.cn/categories/index.html","excerpt":"","text":""},{"title":"关于本博","date":"2019-02-16T15:22:37.000Z","updated":"2019-02-18T08:25:19.189Z","comments":false,"path":"about/index.html","permalink":"https://kkutysllb.cn/about/index.html","excerpt":"","text":"关于我毕业于天津大学大学的70后中老年, kkutysllb是我的英文名（其实是随机敲的字母名）。机缘巧合, 我从航天领域转入了通信运营商 借助2009年大会战的契机，从头开始学通信（基本都是野路子，很少参加所谓的培训）。 当初开始学通信时，看着以前自己设计电路图，画得超漂亮的PCB板图，以及几千行的底层驱动和算法代码，曾很认真的问自己—我真的要抛弃这些吗？陡然发现我从一个研发工程师变成了运维菜鸟，从IC设计行业进入了通信运维行业。么办法，入乡随俗，只能默默将这些材料打包刻录成光盘。 (对~你没有看错，确实是光盘，那时没有网盘，U盘太奢侈）。 关于本网站2019年，是我进入通信行业整整10周年。回首看来，通信这个行业本来是一个高大上的行业（看看当年国内各大高校通信专业高考录取分就明白），但因为国内广大人民群众普遍认为“免费才是硬道理”，导致三大运营商普遍低价竞争（其实免费才是最贵的）。国内某设备商打着”免费送、随便用、无条件支撑”旗号发起的设备低价竞标排挤友商，使得这个行业才会出现如今的局面。 言归正传，本网站的初衷只是写给同行业准备运维转型的同事看的，只是希望将自己踩过的坑贡献出来，避免后来人前赴后继，少走弯路。因此，本网站主要涉及通信ICT运维和DevOps方面的一些浅薄知识。如果您是大神，还请评论时多多指教。 本网站的文章内容最初只是在我的微信公众号（CloudsupermanLLB)上发布。由于公众号排版太费时间，故从今年开始，在个人网站主推，公众号也会不定期更新。 联系方式 个人微信：kkutys 个人邮箱：kkutys@139.com 个人网站：kkutysllb.cn 微信公众号：CloudsupermanLLB（ID:同名）"},{"title":"文章标签","date":"2019-02-18T06:38:10.000Z","updated":"2019-02-18T06:46:47.547Z","comments":false,"path":"tags/index.html","permalink":"https://kkutysllb.cn/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"2018-09-12-云计算的前世今生","slug":"2018-09-12-云计算的前世今生","date":"2018-09-12T00:00:00.000Z","updated":"2019-02-18T08:23:06.625Z","comments":true,"path":"2018/09/12/2018-09-12-云计算的前世今生/","link":"","permalink":"https://kkutysllb.cn/2018/09/12/2018-09-12-云计算的前世今生/","excerpt":"云计算的发展历程 云计算的历史也是蛮好玩的… 一开始就是在2003年之前，大家都在在提升CPU的计算能力，提升存储的空间，使得CPU性能越来越高、存储变得更大。","text":"云计算的发展历程 云计算的历史也是蛮好玩的… 一开始就是在2003年之前，大家都在在提升CPU的计算能力，提升存储的空间，使得CPU性能越来越高、存储变得更大。 到了2003年以后呢，企业的数据中心里面发现资源已经很空闲，因为架构设计的原因，让这些服务器很多时间都处在平均不到5%的使用率，大部分99%都是空闲的。相当云投资一千块，其实只用了五块钱，实际上产生了很大的浪费。同时，机房空间、动力等基础设施资源被占用过多，导致数据中心内部无法放置更多机柜、机架和服务器，需要买地建设新的机房（按照国内的地价/房价，这基本是不可能的）。因此，在2003年VMware这个厂商提供了服务器虚拟化的技术，就是把一台服务器一台设备，切成很多虚拟的小块服务器，也就是俗称的“虚拟机”。而让业务应用在虚拟机上面去工作，这就叫服务器虚拟化。 这个技术解决了数据中心里面机房空间和动力资源不够的问题，原来需要十台服务器的，现在在一台高级的服务器里面切了十份，分别给10个业务应用使用，即使这样也就才用了40%的CPU，电力节省了接近9/10，而且一个机房里面容量就可以做二十倍数的的提升。原来部署一百台物理的服务器，现在可以部署两千台虚拟服务器，大大的提升了资源的利用率。而虚拟化的另一个好处就是还大幅提升了客户业务的创新的积极性，因为以前他们服务器都摆不下，好多东西不能做，现在摆下了，所以他要做什么东西都可以试试。但是这个虚拟化技术只解决了资源的共享问题，还没解决运营效率问题。 到了2006年的时候，亚马逊提出了公有云的服务，那时还不叫云计算，叫Amazon Web Service, 简称AWS（现在亚马逊的云计算项目还是沿用这个叫法）。亚马逊大家都知道，它原本是一个做超市的，超市的概念就是你需要你去拿，拿了就到门口结帐，结帐你就拿走。然后亚马逊它把这个计算资源也当成一种，把服务器也当成资源去卖，但是它卖的不是物理的，不是让你搬一台服务器走。而是建好一个数据中心，当你用的时候，你要多少台我们就给你多少台，你只要刷信用卡在网上做支付，你就可以使用这些逻辑上提供给你的资源，这也是虚拟化资源第一次被当成商品出售的案例。随后，Amazon在此基础上提出了云计算的概念，并开发出了公有云业务。亚马逊的这种公有云的这种服务对企业而言，想做的时候，只要付钱就可以做了。而且一般企业业务部门都很有钱，所以业务部门的愿意投钱去做这个事情。 到了2010年的时候，出现了另外一种云计算架构，叫OpenStack。它是NASA就是美国太空总署那个NASA和RackSpace联合做的。RackSpace也是做公有云服务的运营商，就像我们的阿里云一样，它也是想学习亚马逊。但是它的人没有亚马逊的团队这么大，所以它把这个架构给开源出来，形成一个OpenStack开源社区，大家都在OpenStack上面去开发完善，然后让这个框架变得更好，目前OpenStack会聚了全球的研发力量，并吸引了几乎全球所有主流IT厂商的支持，帮它完善这个架构，形成了云计算领域一个全新的强大生态系统。OpenStack社区把这个架构公开出来以后，各个企业都看到了一个新的技术，可以运用到他们自己企业里面，所以很多企业都开始基于OpenStack做自己的私有云，让自己家的IT，变得效率更高，资源更有效。 然后，到了2014年以后，很多企业经过这么多年的建设以后，基本都走在了公有云和私有云这两条路上，私有云就是在家里，自建自用，不对外。公有云就是公开对外出售虚拟资源（如服务器、负载均衡器、防火墙等）在亚马逊、阿里或者华为都有这类服务，只要花钱买就可以。很多企业，尤其是中小企业，无力承担基础设施建设费用，就是通过购买EC2（云计算服务中资源服务器）来部署它的业务。还有一些企业，将一部分业务部署在公有云上，另一部分私密性业务部署在私有云上，这样就合成了一个混合云的状态。 云计算技术的演进历程 随着云计算技术走向成熟，在混合云时代，企业对于云计算的相关技术成熟度的问题已经不太关注了。企业新的追求是，让IT的人员怎么在一个团队的模式下面，对公有云和私有云的混合云资源进行统一的管理。这是一个管理的概念，也是混合云构建的核心。 云计算（Cloud Computing）是分布式计算（Distributed Computing）、并行计算（Parallel Computing）和网格计算（Grid Computing）的发展或者说是这些计算机科学概念的商业实现。 并行计算（Paralled Computing）：同时使用多种计算资源解决计算问题的过程，主要目的是快速解决大型且复杂的问题。 特点：把计算任务分派给系统内多个计算单元。 分布式计算（Distributed Computing）：把一个需要巨大计算能力才能解决的问题分成多个小部分，把这些小部分分配给多个计算进行处理，最后综合这些计算结果得到最终的结果。 特点：分配计算任务到网络中多台独立的机器。 网格计算（Grid Computing）：利用互联网把地理上广泛分布的各种资源连成一个逻辑的整体，就像一台超级计算机。 特点：分布式计算的一种，为用户提供一体化的信息和应用服务。 云计算的部署模式 私有云（Private Cloud）： 企业利用自有或租用的基础设施资源自建的云。 社区云/行业云（Community cloud）：为特定社区或行业所构建的共享基础设施的云。 公有云（Public cloud）：出租给公众的大型的基础设施的云。 混合云（Hybrid cloud）：由两种或两种以上部署模式组成的云。 从部署模式上看，云计算又分为私有云、社区云也就是行业云、公有云、和混合云，这几种形态，这里也给出了具体的定义。简单理解： 私有云就是企业建在自家院子里的，只给自己用的云，有些公司特别是公有云厂商喜欢把“私有云”称作“专有云”，名字不同，但含义基本相同，虽然这些厂商不愿意承认。 社区云既行业云，应用范围要比私有云广泛，更像是由家庭和家族的关系，往往应用在某个特定的区域或特定行业，主要给特殊血缘关系的行业或社区家族成员使用。 公有云的使用范围则更加宽泛，基本上只要给钱谁都可以用，因此公有云的规模往往也更大。 但公有云的用户鱼龙混杂，像火车站一样，而且目标明显，不仅使用的好人多，惦记着甚至使用的坏人也不少，所以经常成为黑客及非法集团的攻击或信息偷窃目标。但瑕不掩瑜，人们不能因为火车上有小偷，就不坐火车了。但贵重的东西，比如大额现金最好就别随身带了，放家里由家人看着最保险，也就是在使用公有云的同时还使用私有云。而且希望公有云与私有云能很好的协同。这就是混合云了。 云计算当前的商业模式 云基础设施即服务（IaaS）— 出租处理能力、存储空间、网络容量等基本计算资源。 云平台即服务（PaaS）— 为客户开发的应用程序提供可部署的云环境。 云软件即服务（SaaS）— 在网络上提供可直接使的应用程序。 现在不止这几种，还有存储即服务，桌面即服务，数据中心即服务等等。 在服务模式上，云计算分为三种，包括：IaaS 基础设施即服务、PaaS 开发平台即服务、SaaS 软件即服务这三种模式。 IaaS，就是以前买IBM、HP、DELL、华为服务器存储跑企业业务（比如：生产管理业务、财务、市场客户管理、邮箱等），现在企业把业务放到Amazon的网站或华为企业云服务（公有云）网站就全搞定了。简单讲就是由“买”变“租”。大型企业的IT部门也可以以IaaS服务的形式，对内部业务部门提供服务，然后进行内部结算。 PaaS，就是以前企业需要业务软件的时候，软件开发商在自己公司开发完在卖给企业客户，还要派人去安装软件。现在开发、安装都在企业客户那里全做了。当然给的钱也不再是软件费而是人头费了。 SaaS，就是以前写汇报胶片用微软PPT软件，现在登录www.prezi.com，在那个网站上就可以写胶片了，很酷。 云计算的8个通用特点 大规模（Massive scale） 同质化（Homogeneity） 虚拟化（Virtualization） 弹性计算（Resilient computing） 低成本软件（Low cost software） 地理分布（Geographic distribution） 服务定位（Service orientation） 先进安全技术（Advanced security technologies） 这是美国国家标准与技术研究院给云计算列出的8个通用特点： 大规模（Massive scale），因为云计算服务把IT的资源供应集中化了，自然规模很大。也正因为如此，量变导致质变，使得云计算与传统IT有了众多的区别。 同质化（Homogeneity），也可以理解成标准化，这点倒是和用电很类似，大家要保持相同电压、插座接口，这样人们的电器和各种设备才能被广泛使用。 虚拟化（Virtualization），有两层含义，一个是计算单元的精细化，一块蛋糕太大，一个人吃不了，那最好切成小块，大家分着吃，也就是让每个计算单元更小，这样可以充分利用IT资源；另外一层含义是软硬件的分离，虚拟化之前软件和指定硬件是绑在一起的，虚拟化之后软件在所有硬件上可以自由的迁移，这跟人们由买房变成租房是一样的，既然北上广深的房价太高，很多人便租房住了，拎个箱子想住哪就住哪。 弹性计算（Resilient computing），在前面已经说过，指的是IT资源供给可弹性伸缩。 低成本软件（Low cost software），是从竞争与市场需求发展的角度说的。云计算降低了人们使用IT的门槛，不仅仅在个人技术能力上，而且在资金能力上，很多小微的初创企业，本身就没啥钱，希望能够用最少的钱使用最多的IT服务，要想打开这部分市场，自然需要低成本的软件，通过薄利多销的形式赚到更多的钱。 地理分布（Geographic distribution）：前文我们提到了泛在接入，也就是能够在任意时间任意地点提供IT服务。从使用者的角度看，就是地理分散的，由于各地网络带宽的优劣差异，那么IT提供者，也就是云计算数据中心的部署，自然也是呈现出地理分布式特征的。大的公有云厂商都有几十个甚至数百个数据中心或服务节点，面向全球提供云计算服务。 服务定位（Service orientation）：因为云计算是一种服务模式，它的整个体系的设计也就是面向服务的。 先进安全技术（Advanced security technologies），林子大了，什么鸟都有，公有云大了，什么用户也都有，包括好的坏的，自然先进的安全技术保障是一个云计算必须的条件了。 到此为止，对云计算的总结就是：4部署-3服务-5特性-8个通用点，简称4358。 云计算的流派 从实现方式来看，云计算有两个典型的流派：大分小模式和小聚大模式。（现在这个概念已经很少有人提了，因为从资源的使用看，两种流派的本质是相同的） 大分小模式：也称为Amazon流派，不同的应用在使用资源时，通过时分复用算法来调用。 关键技术点包括：计算、存储和网络虚拟化以及虚拟机监控、调度和迁移。 典型代表：Amazon，alibaba，华为的EC2等。 小聚大模式：也称为Google流派，资源在多个应用间贡献，通过将应用划分多个子任务，结合调度算法来实现某个子引用在资源上的独占。 关键技术点包括任务分解、调度、分布式通信总线和全局一致性。 典型代表：Google，我国的天河2号等","categories":[{"name":"云计算","slug":"云计算","permalink":"https://kkutysllb.cn/categories/云计算/"}],"tags":[{"name":"基础概念","slug":"基础概念","permalink":"https://kkutysllb.cn/tags/基础概念/"}],"keywords":[{"name":"云计算","slug":"云计算","permalink":"https://kkutysllb.cn/categories/云计算/"}]},{"title":"2018-09-03-什么是云计算?","slug":"2018-09-03-什么是云计算","date":"2018-09-02T18:25:25.000Z","updated":"2019-02-18T06:29:57.575Z","comments":true,"path":"2018/09/03/2018-09-03-什么是云计算/","link":"","permalink":"https://kkutysllb.cn/2018/09/03/2018-09-03-什么是云计算/","excerpt":"云计算概念的定义 云计算基础知识入门 云计算是一种按使用量付费的模式，这种模式提供可用的、便捷的、按需的网络服务（即随时随地接入可接入），进入可配置的计算资源共享池（包括：网络、服务器、存储、应用软件、服务），这些资源能够被快速提供，只需投入很少的管理工作，或与服务供应商进行很少的交互。（美国国家标准与技术研究院） 云计算是一种基于互联网的计算方式，通过这种方式，共享软硬件资源和信息可以按需求提供给计算机和其他设备。云计算依赖资源的共享以达成规模经济，类似基础设施。（维基百科）","text":"云计算概念的定义 云计算基础知识入门 云计算是一种按使用量付费的模式，这种模式提供可用的、便捷的、按需的网络服务（即随时随地接入可接入），进入可配置的计算资源共享池（包括：网络、服务器、存储、应用软件、服务），这些资源能够被快速提供，只需投入很少的管理工作，或与服务供应商进行很少的交互。（美国国家标准与技术研究院） 云计算是一种基于互联网的计算方式，通过这种方式，共享软硬件资源和信息可以按需求提供给计算机和其他设备。云计算依赖资源的共享以达成规模经济，类似基础设施。（维基百科） 云计算概念诞生之初，市场上对其概念有很多种理解，经过一段时间的争论，现在大家一般来说都认可的就是美国标准与技术研究院的它给出的一个最标准的定义。它把云计算定义为一种模式，而不是一种技术。这种模式既可以是商业模式，也可以是服务模式。 云计算的关键特征 按需自助服务（On-demand Self-service） 无处不在的网络接入（Broad Network Access） 与位置无关的资源池（Locations independent resources pooling） 快速弹性（Rapid Elastic） 按使用付费（Pay per User） 我们从云计算的基本特质上进一步理解一下云计算的概念和内涵。 从管理层面上说，云计算实现了IT资源的按需自助服务。“按需”是从量的角度来说，这是一种“量体裁衣”的资源使用方式，避免粗放管理带来成本损耗。“自助”是从人的角度来说，减少了资源使用者与资源管理者之间的频繁交互，进一步减少人工成本的损耗。同时，从历史上看，IT的使用难度每降低一个层次，IT产业就会获得一次质飞跃，因为客户数量会因此有指数级的提升。而“自助”这种简单化操作意味着更多的人都可以使用IT产品和服务。 云计算实现了广泛网络接入。这意味着用户可以在全球各地7x24小时的使用IT服务，也就是随时、随地、随心、随意的使用。这极大的提升了用户工作的灵活性和经营工作效率。 云计算实现了资源池化。“池化”就意味着资源的同质化、归一化。无论是网络、服务器、存储、应用还是服务，都是这些同质化、归一化资源的组合、协同实现。使用者和管理者只需考虑需求的资源“量”，无需考虑资源提供商之间的差异性。 云计算资源弹性伸缩。是指资源能够快速的供应和释放，就是说当你要的时候，我能快速的很快就给你，不是说你申请了以后，十天半个月我才给你资源，而是你要我马上就给你，当你不用的时候，我马上就回收，资源释放。 从经营层面上说，云计算实现了可计量的服务。“技术免费、服务收费”是开源社区的一个宗旨。前面也提到云计算的本质就是一种服务，为了实现这类服务收费，就必须要求服务可计量，而计量的依据就是资源使用的可计量。比如：按使用小时为时间单位，以服务器CPU个数、占用存储的空间、网络的带宽等综合计费，当然也可以包时、包天、包月那种套餐模式进行计量。而且，计量的越精细，运营效率越高。 以上，就是美国标准与技术研究院给云计算标准的定义时所诠释的特质。 从技术视角来看：云计算=计算/存储的网络 商业视角：云计算=信息电厂计算和存储：由PC时代的局域网向云时代的互联网迁移。软件：由PC时代的终端向云端迁移。 用户消费模式变化 通过互联网提供软硬件与服务； 用户通过浏览器或轻量级终端获取、使用服务。 商业模式发生变化 从“购买软硬件产品”向“购买信息服务”转变，如同100年前用电的转变。 云计算产生的背景 云计算=需求推动+技术进步+商业模式转变 云计算的产生是需求推动、技术进步、商业模式转变共同促进的结果。 需求推动： 政企客户低成本且高性能的信息化需求。 个人用户的互联网、移动互联网应用需求强烈，追求更好用户体验。 技术进步 虚拟化技术、分布与并行计算、互联网技术的发展与成熟，使得基于互联网提供包括IT基础设施、开发平台、软件应用成为可能。 宽带技术及用户发展，使得基于互联网的服务使用模式逐渐成为主流。 商业模式转变 少数云计算的先行者（例如Amazon的IaaS、PaaS)的云计算服务已开始运营。 市场对云计算商业模式已认可，越来越多的用户接受并使用云计算服务。 生态系统正在形成，产业链开始发展和整合。 几年之内，云计算已从新兴技术发展成为当今的热点技术。从Google公开发布的核心文件到Amazon EC2（亚马逊弹性计算云）的商业化应用，再到美国电信巨头AT&amp;T（美国电话电报公司）推出的Synaptic Hosting（动态托管）服务，云计算从节约成本的工具到盈利的推动器，从ISP（网络服务提供商）到电信企业，已然成功地从内置的IT系统演变成公共的服务。","categories":[{"name":"云计算","slug":"云计算","permalink":"https://kkutysllb.cn/categories/云计算/"}],"tags":[{"name":"基本概念","slug":"基本概念","permalink":"https://kkutysllb.cn/tags/基本概念/"}],"keywords":[{"name":"云计算","slug":"云计算","permalink":"https://kkutysllb.cn/categories/云计算/"}]},{"title":"2018-08-31-为什么开始写博客？","slug":"2018-08-31-为什么开始写博客？","date":"2018-08-31T11:36:28.000Z","updated":"2019-02-18T06:42:25.684Z","comments":true,"path":"2018/08/31/2018-08-31-为什么开始写博客？/","link":"","permalink":"https://kkutysllb.cn/2018/08/31/2018-08-31-为什么开始写博客？/","excerpt":"前言2018年3月—7月期间，有幸在外培训，时间相对宽松。当时，主要一直在自学SDN部分知识，鉴于同班同学一直询问询问云计算怎么学习？为此，我特意开通微信公众号，主要讲述一点儿OpenStack的基础知识。（如下）","text":"前言2018年3月—7月期间，有幸在外培训，时间相对宽松。当时，主要一直在自学SDN部分知识，鉴于同班同学一直询问询问云计算怎么学习？为此，我特意开通微信公众号，主要讲述一点儿OpenStack的基础知识。（如下） 当时，还特意列出一个大纲，从最基础的Linux开始，一直到后续高级服务和应用。比如：Tacker、Workflow、批量热迁移等。 但是，微信公众号的排版实在是太浪费时间，再加上后续回到工作岗位，个人时间实在有限，因此公众号的内容一直处在长期停更，偶尔写写的状态。实在有愧大家的期待-_-!!! 在2018年7月期间，一个偶然的机会让我接触到hexo和markdown两个小伙伴，让我燃起了写技术博客的动力。hexo主要用来生成静态页面，而markdown是一种极简的文本编写工具，其语法格式只有十来种，对编写网页博客有很大助力：-）利用这两个工具，可以提升网文的写作效率。至于怎么使用，网上的教程很多，大家可以自信搜索。 言归正传，后续公众号中已完成的内容我会逐渐搬到个人博客中来，并对前期挖的坑做个填补-_-!!!。新增的内容主要在个人博客中完成，微信公众号只能有空闲时间后，再进行补充，还请大家以后多关注博客内容。 另外，大家有什么疑惑，以后都可以在博客的留言区进行留言。","categories":[{"name":"随笔杂感","slug":"随笔杂感","permalink":"https://kkutysllb.cn/categories/随笔杂感/"}],"tags":[{"name":"篇首语","slug":"篇首语","permalink":"https://kkutysllb.cn/tags/篇首语/"}],"keywords":[{"name":"随笔杂感","slug":"随笔杂感","permalink":"https://kkutysllb.cn/categories/随笔杂感/"}]},{"title":"2018-08-31-写在前面的话","slug":"2018-08-31-写在前面的话","date":"2018-08-30T18:23:41.000Z","updated":"2019-02-18T06:29:45.498Z","comments":true,"path":"2018/08/31/2018-08-31-写在前面的话/","link":"","permalink":"https://kkutysllb.cn/2018/08/31/2018-08-31-写在前面的话/","excerpt":"学习大纲 鉴于好多人询问云计算怎么学习？我的建议是实践和理论相结合！IT不像CT那么多理论和流程，IT诞生和发展的源动力就是提升工作效率。因此，IT的理论并没有CT那么难，但是要想用好，用巧必须具备相当丰富的实操经验。对于新手，最好的学习方式就是边实践边消化相关理论流程。","text":"学习大纲 鉴于好多人询问云计算怎么学习？我的建议是实践和理论相结合！IT不像CT那么多理论和流程，IT诞生和发展的源动力就是提升工作效率。因此，IT的理论并没有CT那么难，但是要想用好，用巧必须具备相当丰富的实操经验。对于新手，最好的学习方式就是边实践边消化相关理论流程。 OpenStack是目前最成熟并且符合生产部署的一套开源云操作系统，全球各大IT，CT厂商，甚至运营商都为此投入了大量的人力、物力和精力。由于其开源的特性，全世界的云计算爱好者也为此贡献了很多。从openstack的特点来看，它是由python语音开发，是一个提供多种服务，相当灵活和稳定的云操作系统。以前的定义主要集中IaaS层（基础设施层），但是现在随着docker的出现，IaaS和PaaS（平台层）的界限已经非常模糊，同时随着K8s的兴起，甚至与SaaS的界限也不再清晰。从操作系统的组成来看，openstack+docker+k8s的组合更像一个更广泛的云化操作系统，openstack是内核，dokcer是用户空间，K8s是调用各项基础进程的API。 转入正题，由于openstack非常灵活，同时也就引入另一个问题，学习起来非常困难。因此，在学习openstack的同时，如果自己手头有一套实验环境那是相当的完美。我当初学习openstack是从devstack开始学起（openstack开发者版本），同时我也建议初学者从devstack开始学起。接下来我们就开始学习OpenStack的第一步，基础准备工作。 工具准备 学习云计算的硬件和软件条件 1、一台不少于16G内存，2CPU+内核笔记本或二手服务器，且硬件要开启支持虚拟化功能。BIOS中的开启方法如下图所示： 2、下载CentOS 7的光盘安装镜像。下载地址在CentOS官网链接，下载DVD版本即可。https://www.centos.org/download/ 3、去VMWare官网下载VMWare虚拟机软件，需要新注册个账号。下载链接如下：（注意：如果你你的宿主机是win10系统，不要下载VirtualBox，因为win10的无线网络在VirtualBox中设置桥接网络有BUG）https://www.vmware.com/cn/support/workstation.html 以上工具就是我们环境搭建需要的基本工具。还有一些辅助工具如：XShell、XFTP可自行百度下载（个人版在官网申请是免费，记得千万不要升级） 下载地址如下： http://www.netsarang.com/products/xsh_overview.html","categories":[{"name":"云计算","slug":"云计算","permalink":"https://kkutysllb.cn/categories/云计算/"}],"tags":[{"name":"OpenStack","slug":"OpenStack","permalink":"https://kkutysllb.cn/tags/OpenStack/"},{"name":"基础准备","slug":"基础准备","permalink":"https://kkutysllb.cn/tags/基础准备/"}],"keywords":[{"name":"云计算","slug":"云计算","permalink":"https://kkutysllb.cn/categories/云计算/"}]}]}